Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.swift.regexvisualization.icuregextorailroadconverter.lazy.81fd67d0
source: lazy
zh_hans: 懒惰

# ui.swift.regexvisualization.icuregextorailroadconverter.line_feed.46f77b43
source: line feed
zh_hans: 换行符 LF

# ui.swift.regexvisualization.icuregextorailroadconverter.lookahead.ce9a8bb4
source: lookahead
zh_hans: 正向先行断言

# ui.swift.regexvisualization.icuregextorailroadconverter.lookbehind.e7d87dd7
source: lookbehind
zh_hans: 正向后顾断言

source: negative lookahead
zh_hans: 负向先行断言

source: negative lookbehind
zh_hans: 负向后顾断言

# ui.swift.regexvisualization.icuregextorailroadconverter.newline.ea889d83
source: newline
zh_hans: 换行序列

# ui.swift.regexvisualization.icuregextorailroadconverter.non_digit.527a4572
source: non-digit
zh_hans: 非数字

source: non-horizontal whitespace
zh_hans: 非水平空白字符

source: non-vertical whitespace
zh_hans: 非垂直空白字符

# ui.swift.regexvisualization.icuregextorailroadconverter.non_whitespace.6c820459
source: non-whitespace
zh_hans: 非空白字符

source: non-word boundary
zh_hans: 非单词边界

source: non-word character
zh_hans: 非单词字符

# ui.swift.regexvisualization.icuregextorailroadconverter.not.254bb97b
source: not
zh_hans: 非

# ui.swift.regexvisualization.icuregextorailroadconverter.possessive.f64df5ab
source: possessive
zh_hans: 占有

# ui.swift.regexvisualization.icuregextorailroadconverter.start_of_input.8add6f8f
source: start of input
zh_hans: 输入开头

# ui.swift.regexvisualization.icuregextorailroadconverter.start_of_line.6e2b24aa
source: start of line
zh_hans: 行首

# ui.swift.regexvisualization.icuregextorailroadconverter.tab.7508386a
source: tab
zh_hans: 制表符

source: vertical whitespace
zh_hans: 垂直空白字符

# ui.swift.regexvisualization.icuregextorailroadconverter.whitespace.6db1c4fb
source: whitespace
zh_hans: 空白字符

# ui.swift.regexvisualization.icuregextorailroadconverter.word_boundary.85f13795
source: word boundary
zh_hans: 单词边界

# ui.swift.regexvisualization.icuregextorailroadconverter.word_character.03d81287
source: word character
zh_hans: 单词字符

# ui.swift.screenshots.itermscreenshotpanel.annotations.ba40dd9e
source: Annotations:
zh_hans: 注释：

# ui.swift.screenshots.itermscreenshotpanel.blur.cd83e673
source: Blur
zh_hans: 模糊

# ui.swift.screenshots.itermscreenshotpanel.blur_radius.cd1166fd
source: Blur radius:
zh_hans: 模糊半径：

# ui.swift.screenshots.itermscreenshotpanel.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.screenshots.itermscreenshotpanel.clear_all.ddceb7ad
source: Clear All
zh_hans: 全部清除

# ui.swift.screenshots.itermscreenshotpanel.copied.8d525e5f
source: Copied
zh_hans: 已拷贝

# ui.swift.screenshots.itermscreenshotpanel.copied.ea61bc15
source: Copied!
zh_hans: 已拷贝！

# ui.swift.screenshots.itermscreenshotpanel.copy_to_clipboard.fa8f2b6c
source: Copy to Clipboard
zh_hans: 拷贝到剪贴板

# ui.swift.screenshots.itermscreenshotpanel.copying.d250fad8
source: Copying…
zh_hans: 正在拷贝…

# ui.swift.screenshots.itermscreenshotpanel.encoding.7f8d2d32
source: Encoding…
zh_hans: 正在编码…

# ui.swift.screenshots.itermscreenshotpanel.fill_color.d0d35a65
source: Fill color:
zh_hans: 填充颜色：

# ui.swift.screenshots.itermscreenshotpanel.highlight.07ccd15d
source: Highlight
zh_hans: 高亮显示

# ui.swift.screenshots.itermscreenshotpanel.highlight_selection.da82d0b3
source: Highlight Selection
zh_hans: 高亮所选内容

# ui.swift.screenshots.itermscreenshotpanel.label.0e66373f
source: Label
zh_hans: 标签

source: ⚠️ Large screenshot will be saved as %1$lld files.
zh_hans: ⚠️ 大型截图将存储为 %1$lld 个文件。

# ui.swift.screenshots.itermscreenshotpanel.line_range.9bb57950
source: Line range:
zh_hans: 行范围：

# ui.swift.screenshots.itermscreenshotpanel.make_screenshot.ef195e57
source: Make Screenshot
zh_hans: 截图

source: No annotations. Select text and click a button above.
zh_hans: 没有注释。请选择文本并点按上方按钮。

# ui.swift.screenshots.itermscreenshotpanel.redact.cbea5870
source: Redact
zh_hans: 遮盖

# ui.swift.screenshots.itermscreenshotpanel.redact_selection.093b646e
source: Redact Selection
zh_hans: 隐去所选内容

# ui.swift.screenshots.itermscreenshotpanel.redaction_method.54f3a62a
source: Redaction method:
zh_hans: 遮盖方式：

# ui.swift.screenshots.itermscreenshotpanel.save.1509f561
source: Save
zh_hans: 保存

# ui.swift.screenshots.itermscreenshotpanel.save_as.a4b76af5
source: Save As…
zh_hans: 另存为…

# ui.swift.screenshots.itermscreenshotpanel.saving.23e39291
source: Saving…
zh_hans: 正在保存…

# ui.swift.screenshots.itermscreenshotpanel.saving_file_0_of_1.1486f184
source: Saving file %1$lld of %2$lld
zh_hans: 正在保存第 %1$lld 个文件，共 %2$lld 个

source: Select text in the terminal, then click a button below.
zh_hans: 在终端中选择文本，然后点按下方按钮。

# ui.swift.screenshots.itermscreenshotpanel.solid_color.b3b9a4e5
source: Solid Color
zh_hans: 纯色

# ui.swift.screenshots.itermscreenshotpanel.to.663ea1bf
source: to
zh_hans: 至

# ui.swift.screenshots.itermscreenshotredaction.0_lines.cef20f90
source: %1$lld lines
zh_hans: %1$lld 行

# ui.swift.screenshots.itermscreenshotredaction.1_line.7de203a2
source: 1 line
zh_hans: 1 行

# ui.swift.searchingfiltering.filtertextfield.filter.638e249f
source: Filter
zh_hans: 过滤

# ui.swift.sessionnotes.sessionnoteview.collapse.be6eb1fc
source: Collapse
zh_hans: 折叠

# ui.swift.sessionnotes.sessionnoteview.expand.07548c2c
source: Expand
zh_hans: 展开

# ui.swift.sessionnotes.sessionnoteview.session_note.92b3980a
source: Session Note
zh_hans: 会话备注

source: Permanently hide %1$@ button
zh_hans: 永久隐藏“%1$@”按钮

# ui.swift.settings.donateviewcontroller.donate.c91ee0f2
source: Donate
zh_hans: 捐赠

source: Help iTerm2 grow – Consider donating.
zh_hans: 帮助 iTerm2 成长——请考虑捐赠。

source: iTerm2 is one person’s project. Donate now!
zh_hans: iTerm2 是由一人维护的项目。立即捐赠！

source: iTerm2 needs your support – Donate here.
zh_hans: iTerm2 需要您的支持——在此捐赠。

# ui.swift.settings.donateviewcontroller.keep_iterm2_alive_donate_today.a145f6d2
source: Keep iTerm2 alive — Donate today!
zh_hans: 让 iTerm2 持续发展——立即捐赠！

source: Keep the iTerm2 dream alive – Donate!
zh_hans: 延续 iTerm2 的梦想——请捐赠！

source: Love using iTerm2? Help keep it thriving!
zh_hans: 喜欢使用 iTerm2？帮助它继续蓬勃发展！

# ui.swift.settings.donateviewcontroller.support_iterm2.f8b2d6dd
source: Support iTerm2
zh_hans: 支持 iTerm2

source: Support the creator of iTerm2 – Donate now!
zh_hans: 支持 iTerm2 的创作者——立即捐赠！

# ui.swift.settings.expandingtextfield.expand.07548c2c
source: Expand
zh_hans: 展开

source: ### Background Binding a setting to an expression lets you change settings programmatically. iTerm2 tracks a collection of “Variables” for each session. You can learn more about them in [Scripting Fundamentals](https://iterm2.com/documentation-scripting-fundamentals.html). Typically this feature is used by binding a setting to a user-defined variable. ### Example The easiest way to set a user-defined variable is to install shell integration and then define a `iterm2_print_user_vars` function. Here's an example using bash: ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` This runs each time the shell prompt is printed. The example sets a user-defined variable to the value of the environment variable `%3$@`. The appropriate expression to bind this example would be `user.%4$@`. All user-defined variables go in the `user` scope. ### Debugging You can view variables in the Inspector (**Scripts > Manage > Console** and then click **Inspector**).
zh_hans: ### 背景 将设置绑定到表达式后，您可以通过编程方式更改设置。 iTerm2 会跟踪每个会话的一组“变量”。有关详情，请参阅[脚本编写基础](https://iterm2.com/documentation-scripting-fundamentals.html)。 此功能通常用于将设置绑定到用户定义变量。 ### 示例 设置用户定义变量最简单的方法是安装 Shell 集成，然后定义 `iterm2_print_user_vars` 函数。下面是一个 bash 示例： ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` 每次显示 Shell 提示符时都会运行此函数。此示例将用户定义变量设置为环境变量 `%3$@` 的值。 此示例应绑定的表达式为 `user.%4$@`。所有用户定义变量都位于 `user` 作用域中。 ### 调试 您可以在检查器中查看变量（**脚本 > 管理 > 控制台**，然后点按**检查器**）。

# ui.swift.settings.expressionbindableview.bind_expression_to_setting.4d553846
source: Bind Expression to Setting
zh_hans: 将表达式绑定到设置

# ui.swift.settings.expressionbindableview.bind_to_expression.75978f1e
source: Bind to Expression
zh_hans: 绑定到表达式

# ui.swift.settings.expressionbindableview.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.settings.expressionbindableview.edit_expression_binding.dec17462
source: Edit Expression Binding
zh_hans: 编辑表达式绑定

source: Enter expression to bind to this setting, or leave empty to clear the binding.
zh_hans: 输入要绑定到此设置的表达式，或留空以清除绑定。

# ui.swift.settings.expressionbindableview.expression_e_g_0.9d625246
source: Expression (e.g., %1$@)
zh_hans: 表达式（例如 %1$@）

# ui.swift.settings.expressionbindableview.for_this_setting_0.c5f1afc1
source: ### For This Setting %1$@
zh_hans: ### 此设置 %1$@

# ui.swift.settings.expressionbindableview.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.settings.expressionbindableview.remove_expression_binding.2865ff4c
source: Remove Expression Binding
zh_hans: 移除表达式绑定

# ui.swift.settings.expressionbindingiconview.expression_binding.1ed3cc16
source: Expression Binding
zh_hans: 表达式绑定

source: A bug was encountered: %1$@. Please report this at https://iterm2.com/bugs
zh_hans: 遇到 Bug：%1$@。请前往 https://iterm2.com/bugs 报告此问题

source: Any needed Python runtimes will be installed and secure settings will be updated, which may require you to enter your password. Then iTerm2 will restart and finish importing. This can take several minutes.
zh_hans: 将安装所需的 Python 运行时并更新安全设置，期间可能需要输入您的密码。随后 iTerm2 将重新启动并完成导入。此过程可能需要几分钟。

# ui.swift.settings.importexport.application_support.7ef6ff25
source: Application Support
zh_hans: 应用程序支持

# ui.swift.settings.importexport.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.settings.importexport.dry_run_complete.acf67e21
source: Dry Run Complete
zh_hans: 试运行完成

# ui.swift.settings.importexport.dry_run_erase.3931a071
source: Dry-Run Erase?
zh_hans: 试运行抹掉操作？

# ui.swift.settings.importexport.dry_run_mode_is_enabled_iterm2_will_log.6374541d
source: Dry-run mode is enabled. iTerm2 will log to Console.app what it would erase and stay running. Nothing will actually be deleted.
zh_hans: 已启用试运行模式。iTerm2 会在 Console.app 中记录原本要抹掉的内容，并继续运行。不会实际删除任何内容。

# ui.swift.settings.importexport.erase_all_settings_and_data.e592af72
source: Erase All Settings and Data
zh_hans: 抹掉所有设置和数据

# ui.swift.settings.importexport.erase_everything.16313de3
source: Erase Everything?
zh_hans: 抹掉所有内容？

# ui.swift.settings.importexport.erase_everything_and_quit.4acae498
source: Erase Everything and Quit
zh_hans: 抹掉所有内容并退出

# ui.swift.settings.importexport.export_first.5eab6bb1
source: Export First
zh_hans: 先导出

# ui.swift.settings.importexport.export_iterm2_settings_and_data.cfb0f5f7
source: Export iTerm2 Settings and Data
zh_hans: 导出 iTerm2 设置和数据

# ui.swift.settings.importexport.extracting_archive.f9d33e01
source: Extracting Archive
zh_hans: 正在解压归档

# ui.swift.settings.importexport.failed_to_copy_file_0.c9c6e918
source: Failed to copy file: %1$@
zh_hans: 无法拷贝文件：%1$@

# ui.swift.settings.importexport.failed_to_create_archive_0.a290c2fa
source: Failed to create archive: %1$@
zh_hans: 无法创建归档：%1$@

# ui.swift.settings.importexport.failed_to_create_folder_0.3457e17b
source: Failed to create folder: %1$@
zh_hans: 无法创建文件夹：%1$@

# ui.swift.settings.importexport.failed_to_create_temporary_directory_0.5f642f7f
source: Failed to create temporary directory: %1$@
zh_hans: 无法创建临时目录：%1$@

# ui.swift.settings.importexport.failed_to_install_python_runtime.99195490
source: Failed to install Python runtime
zh_hans: 无法安装 Python 运行时

# ui.swift.settings.importexport.failed_to_load_file_0.c0a2c438
source: Failed to load file: %1$@
zh_hans: 无法加载文件：%1$@

# ui.swift.settings.importexport.failed_to_save_file_0.80945e86
source: Failed to save file: %1$@
zh_hans: 无法存储文件：%1$@

# ui.swift.settings.importexport.failed_to_serialize_user_defaults.095521de
source: Failed to serialize user defaults
zh_hans: 无法序列化用户默认设置

# ui.swift.settings.importexport.import_script_0_of_1.2fa58584
source: Import script %1$lld of %2$lld
zh_hans: 正在导入脚本（第 %1$lld 个，共 %2$lld 个）

# ui.swift.settings.importexport.importing_0.f401d743
source: Importing %1$@
zh_hans: 正在导入：%1$@

# ui.swift.settings.importexport.importing_settings_and_data.c617ab5e
source: Importing Settings and Data
zh_hans: 正在导入设置和数据

# ui.swift.settings.importexport.installing_python_runtime_0_of_1.44766448
source: Installing Python runtime %1$lld of %2$lld
zh_hans: 正在安装 Python 运行时（第 %1$lld 个，共 %2$lld 个）

# ui.swift.settings.importexport.invalid_data_found_at_0.556efe68
source: Invalid data found at %1$@
zh_hans: 在 %1$@ 发现无效数据

source: iTerm2 logged what it would have erased to Console.app. Nothing was actually deleted because the “Dry-run Erase All Settings and Data” advanced setting is enabled.
zh_hans: iTerm2 已在 Console.app 中记录原本要抹掉的内容。由于已启用“试运行抹掉所有设置和数据”高级设置，没有实际删除任何内容。

# ui.swift.settings.importexport.iterm2_state_itermexport.be363a6c
source: iTerm2 State.itermexport
zh_hans: iTerm2 设置与数据.itermexport

# ui.swift.settings.importexport.malformed_data_found_0.7bbaeb16
source: Malformed data found: %1$@
zh_hans: 发现格式错误的数据：%1$@

# ui.swift.settings.importexport.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.settings.importexport.problem_exporting_settings_and_data.5cec6267
source: Problem Exporting Settings and Data
zh_hans: 导出设置和数据时出现问题

# ui.swift.settings.importexport.python_api_authorization_setting.b36b2ca9
source: Python API Authorization Setting
zh_hans: Python API 授权设置

# ui.swift.settings.importexport.python_api_scripts.64843f3a
source: Python API Scripts
zh_hans: Python API 脚本

# ui.swift.settings.importexport.python_runtimes.4a006a73
source: Python Runtimes
zh_hans: Python 运行时

# ui.swift.settings.importexport.run_dry_run.3faab382
source: Run Dry Run
zh_hans: 运行试运行

# ui.swift.settings.importexport.script_could_not_be_exported_0.3f7542bd
source: Script could not be exported: %1$@
zh_hans: 无法导出脚本：%1$@

# ui.swift.settings.importexport.secure_settings.30963f1b
source: Secure Settings
zh_hans: 安全设置

# ui.swift.settings.importexport.skip_export.dce101a3
source: Skip Export
zh_hans: 跳过导出

source: The following will be erased and iTerm2 will quit immediately: • Preferences (profiles, key bindings, arrangements, advanced settings) • Saved windows and sessions • Python API scripts and runtimes • Secure settings • The contents of ~/.iterm2 and ~/Library/Application Support/iTerm2 Items stored in the macOS Keychain (such as the AI API key and Password Manager entries) are not erased and must be removed manually from Keychain Access if you want them gone too. On systems with networked home directories, secure settings stored under /usr/local are written by an administrator and may also need to be removed manually. This cannot be undone.
zh_hans: 以下内容将被抹掉，iTerm2 随即退出： • 设置（配置文件、按键绑定、窗口布局、高级设置） • 已存储的窗口和会话 • Python API 脚本和运行时 • 安全设置 • ~/.iterm2 和 ~/Library/Application Support/iTerm2 中的内容 macOS 钥匙串中存储的项目（如 AI API 密钥和密码管理器条目）不会被抹掉；若也要移除，必须在“钥匙串访问”中手动删除。对于使用网络主目录的系统，存储在 /usr/local 下的安全设置由管理员写入，可能也需要手动移除。 此操作无法撤销。

# ui.swift.settings.importexport.unexpected_error_0.de613ef4
source: Unexpected error: %1$@
zh_hans: 意外错误：%1$@

# ui.swift.settings.importexport.user_defaults.484ba876
source: User Defaults
zh_hans: 用户默认设置

source: Would you like to export your settings and data first? You will be able to re-import the exported file later if you change your mind.
zh_hans: 要先导出设置和数据吗？如果之后改变主意，可以重新导入导出的文件。

# ui.swift.settings.importexport.wrong_format_content_for_0.4a1add6a
source: Wrong format content for %1$@
zh_hans: %1$@ 中的内容格式错误

# ui.swift.settings.itermbrowserpluginfinder.choose.c7f93783
source: Choose
zh_hans: 选择

# ui.swift.settings.itermbrowserpluginfinder.select_0.5d348f18
source: Select %1$@
zh_hans: 选择%1$@

# ui.swift.settings.itermbrowserpluginfinder.select_0.5fd5246b
source: Select %1$@.
zh_hans: 请选择 %1$@。

# ui.swift.settings.itermbrowserpluginfinder.you_must_select_0.d648f864
source: You must select %1$@
zh_hans: 必须选择 %1$@

# ui.swift.settings.itermkeymappingrepair.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.settings.itermkeymappingrepair.repair.1196b6c5
source: Repair
zh_hans: 修复

# ui.swift.settings.itermkeymappingrepair.unknown_action.7ef8915e
source: Unknown action
zh_hans: 未知操作

# ui.swift.settings.menuitempopupview.0_new_tab.90b97d6d
source: %1$@ — New Tab
zh_hans: %1$@ — 新建标签页

# ui.swift.settings.menuitempopupview.0_new_window.83f5d25f
source: %1$@ — New Window
zh_hans: %1$@ — 新建窗口

# ui.swift.settings.menuitempopupview.move_to_0.699bb2f5
source: Move to %1$@
zh_hans: 移到 %1$@

# ui.swift.settings.menuitempopupview.select_menu_item.b037b203
source: Select Menu Item…
zh_hans: 选择菜单项…

# ui.swift.settings.nerdfontinstaller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.settings.nerdfontinstaller.download.d6eafe82
source: Download
zh_hans: 下载

# ui.swift.settings.nerdfontinstaller.download_failed_0.7f360187
source: Download failed: %1$@
zh_hans: 下载失败：%1$@

# ui.swift.settings.nerdfontinstaller.download_needed.20fbc9f5
source: Download Needed
zh_hans: 需要下载

source: Downloaded file could not be saved: %1$@
zh_hans: 无法存储下载的文件：%1$@

source: Installation of downloaded fonts failed: %1$@
zh_hans: 安装下载的字体失败：%1$@

source: The downloaded bundle is missing some required fonts
zh_hans: 下载的字体包缺少部分必需字体

source: The Nerd Font Bundle download failed with an error: %1$@
zh_hans: Nerd Font Bundle 下载失败，错误：%1$@

source: To install the Nerd Font Bundle iTerm2 must first download and install these fonts: %1$@.
zh_hans: 要安装 Nerd Font Bundle，iTerm2 必须先下载并安装以下字体：%1$@。

# ui.swift.settings.nerdfontinstaller.unknown_errors_occurred.93a82287
source: Unknown errors occurred
zh_hans: 发生未知错误

# ui.swift.settings.nerdfontinstaller.unzip_failed_0.da6f9340
source: Unzip failed: %1$@
zh_hans: 解压失败：%1$@

# ui.swift.settings.nerdfontinstaller.user_denied_permission.13950e32
source: User denied permission
zh_hans: 用户拒绝了权限

source: Browser page zoom
zh_hans: 浏览器页面缩放

# ui.swift.settings.secureuserdefaults.0_is_a_file_not_a_directory_please.503d44d0
source: %1$@ is a file, not a directory. Please remove it and try again.
zh_hans: %1$@ 是文件而不是目录。请将其移除后重试。

source: Failed to create %1$@. Please manually create this folder.
zh_hans: 无法创建 %1$@。请手动创建此文件夹。

# ui.swift.settings.secureuserdefaults.failed_to_save_secure_setting.66147c80
source: Failed to Save Secure Setting
zh_hans: 无法存储安全设置

source: iTerm2 needs to modify a secure setting.
zh_hans: iTerm2 需要修改一项安全设置。

source: iTerm2 needs to modify secure settings.
zh_hans: iTerm2 需要修改安全设置。

# ui.swift.settings.secureuserdefaults.ok.565339bc
source: OK
zh_hans: 好

source: The containing directory for secure user defaults does not exist
zh_hans: 安全用户默认设置所在的目录不存在

source: The secure user default is corrupted.
zh_hans: 安全用户默认设置已损坏。

# ui.swift.settings.specialexceptionswindowcontroller.arabic.bafb66f3
source: Arabic
zh_hans: 阿拉伯文

# ui.swift.settings.specialexceptionswindowcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.settings.specialexceptionswindowcontroller.confirm.eebdd24a
source: Confirm
zh_hans: 确认

# ui.swift.settings.specialexceptionswindowcontroller.cyrillic.c2ce0b67
source: Cyrillic
zh_hans: 西里尔文

source: End is higher than U+110000, the maximum Unicode code point.
zh_hans: 结束值高于 Unicode 码位上限 U+110000。

source: Greek (Greek and Coptic)
zh_hans: 希腊文（希腊文和科普特文）

source: Han (CJK Unified Ideographs)
zh_hans: 汉字（CJK 统一表意文字）

# ui.swift.settings.specialexceptionswindowcontroller.hangul_syllables.f73896af
source: Hangul Syllables
zh_hans: 韩文音节

# ui.swift.settings.specialexceptionswindowcontroller.hiragana_katakana.aee37c4e
source: Hiragana/Katakana
zh_hans: 平假名/片假名

# ui.swift.settings.specialexceptionswindowcontroller.invalid_destination.14f03ffa
source: Invalid destination
zh_hans: 目标无效

# ui.swift.settings.specialexceptionswindowcontroller.invalid_destination.9dae5c8d
source: Invalid destination.
zh_hans: 目标无效。

# ui.swift.settings.specialexceptionswindowcontroller.invalid_range.37ef0f0c
source: Invalid range.
zh_hans: 范围无效。

# ui.swift.settings.specialexceptionswindowcontroller.no_font_selected.fbdfbcaf
source: No font selected.
zh_hans: 未选择字体。

# ui.swift.settings.specialexceptionswindowcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.settings.specialexceptionswindowcontroller.private_use_area.f4b3aeae
source: Private Use Area
zh_hans: 专用区

source: Problem Importing Special Exceptions
zh_hans: 导入特殊例外时出现问题

source: Range includes an already-assigned code point.
zh_hans: 范围包含已分配的码位。

source: Start must be at least U+80. ASCII doesn’t support special exceptions.
zh_hans: 起始值必须至少为 U+80。ASCII 不支持特殊例外。

source: This file is from a newer version of iTerm2 and cannot be loaded.
zh_hans: 此文件来自更高版本的 iTerm2，无法加载。

source: This file is not well formed. Is it from a newer version of iTerm2?
zh_hans: 此文件格式不正确。它是否来自更高版本的 iTerm2？

source: This will replace existing special exceptions. Continue?
zh_hans: 这将替换现有特殊例外。要继续吗？

# ui.swift.settings.specialexceptionswindowcontroller.truncated.37733b7c
source: [truncated]
zh_hans: [已截断]

source: You must install the following fonts to use the exceptions in this file: %1$@
zh_hans: 必须安装以下字体才能使用此文件中的例外： %1$@

source: Destination folder on remote host:
zh_hans: 远程主机上的目标文件夹：

# ui.swift.settings.sshconfigurationwindowcontroller.select_ssh_binary.56c38876
source: Select SSH Binary
zh_hans: 选择 SSH 可执行文件

source: Selected file must be an executable.
zh_hans: 所选文件必须是可执行文件。

source: Disable Loading Settings from URL
zh_hans: 禁止从 URL 加载设置

source: Hide Unsaved Changes Notification
zh_hans: 隐藏未保存更改通知

# ui.swift.settings.userdefaultsunsavedcontroller.save_settings.ec92e1dc
source: Save Settings
zh_hans: 保存设置

source: Save Settings Automatically
zh_hans: 自动保存设置

# ui.swift.sharing.commandsharemenuprovider.add_command_as_snippet.1d7e8a18
source: Add Command as Snippet
zh_hans: 将命令添加为片段

# ui.swift.sharing.commandsharemenuprovider.copied.8d525e5f
source: Copied
zh_hans: 已拷贝

# ui.swift.sharing.commandsharemenuprovider.copy_command_url_to_clipboard.f165a68f
source: Copy Command URL to Clipboard
zh_hans: 将命令 URL 拷贝到剪贴板

# ui.swift.sharing.commandsharemenuprovider.save_command_output.50dceb6f
source: Save Command & Output…
zh_hans: 保存命令和输出…

# ui.swift.sharing.commandsharemenuprovider.share_command_output.383ff6e0
source: Share Command Output…
zh_hans: 共享命令输出…

# ui.swift.sharing.commandsharemenuprovider.share_command_url.3daeb75f
source: Share Command URL…
zh_hans: 共享命令 URL…

# ui.swift.sharing.commandsharemenuprovider.snippet_added.0a54b0a6
source: Snippet Added
zh_hans: 已添加片段

# ui.swift.ssh.conductor.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.ssh.conductor.download.d6eafe82
source: Download
zh_hans: 下载

# ui.swift.ssh.conductor.download_0_or_view_in_browser.4b7e4f54
source: Download %1$@ or view in browser?
zh_hans: 下载%1$@，还是在浏览器中查看？

# ui.swift.ssh.conductor.download_or_view_file.93933ce9
source: Download or View File?
zh_hans: 下载还是查看文件？

# ui.swift.ssh.conductor.view.dcc839a4
source: View
zh_hans: 查看

# ui.swift.ssh.conductorfiletransfer.0_via_ssh_integration.8acd2af9
source: %1$@ via SSH Integration
zh_hans: %1$@（通过 SSH 集成）

source: iTerm2 SSH Integration Protocol User name: %1$@") Host: %2$@ File: %3$@"
zh_hans: iTerm2 SSH 集成协议 用户名：%1$@") 主机：%2$@ 文件：%3$@"

# ui.swift.ssh.conductorfiletransfer.ssh_integration.2de7a54f
source: SSH Integration
zh_hans: SSH 集成

# ui.swift.ssh.conductorfiletransfer.unknown.8fe7794d
source: (unknown)
zh_hans: （未知）

# ui.swift.ssh.sshendpointexception.file_transfer_canceled.699d73cf
source: File transfer canceled
zh_hans: 文件传输已取消

# ui.swift.ssh.sshendpointexception.internal_error.1dac8dea
source: Internal error
zh_hans: 内部错误

# ui.swift.ssh.sshfilepanel.a_file_with_the_name_0_on_1.249b4ded
source: A file with the name “%1$@” on %2$@ already exists in this location. Do you want to replace it?
zh_hans: %2$@ 上此位置已存在名为“%1$@”的文件。要替换它吗？

# ui.swift.ssh.sshfilepanel.back.76900f1b
source: Back
zh_hans: 后退

# ui.swift.ssh.sshfilepanel.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.ssh.sshfilepanel.could_not_save_file.b84a9a78
source: Could not save file
zh_hans: 无法保存文件
